// *** IR Dump After mlir::iree_compiler::IREE::SIP::MaterializeReflectionAttrsPass ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = flow.variable.address @"__iree_flow___sm_node17__model.layer-1.kernel" : !iree.ptr<tensor<784x128xf32>>
  %1 = flow.variable.address @"__iree_flow___sm_node18__model.layer-1.bias" : !iree.ptr<tensor<128xf32>>
  %2 = flow.variable.address @"__iree_flow___sm_node24__model.layer-2.kernel" : !iree.ptr<tensor<128x10xf32>>
  %3 = flow.variable.address @"__iree_flow___sm_node25__model.layer-2.bias" : !iree.ptr<tensor<10xf32>>
  %4 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %5 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %6 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %7 = flow.variable.load.indirect %3 : !iree.ptr<tensor<10xf32>> -> tensor<10xf32>
  %8 = flow.variable.load.indirect %2 : !iree.ptr<tensor<128x10xf32>> -> tensor<128x10xf32>
  %9 = flow.variable.load.indirect %1 : !iree.ptr<tensor<128xf32>> -> tensor<128xf32>
  %10 = flow.variable.load.indirect %0 : !iree.ptr<tensor<784x128xf32>> -> tensor<784x128xf32>
  %11 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %12 = "mhlo.dot"(%11, %10) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %13 = "mhlo.broadcast_in_dim"(%9) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %14 = mhlo.add %12, %13 : tensor<1x128xf32>
  %15 = mhlo.maximum %14, %4 : tensor<1x128xf32>
  %16 = "mhlo.dot"(%15, %8) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %17 = "mhlo.broadcast_in_dim"(%7) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %18 = mhlo.add %16, %17 : tensor<1x10xf32>
  %19 = "mhlo.reduce"(%18, %5) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %26 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%26) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %20 = "mhlo.broadcast_in_dim"(%19) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %21 = mhlo.subtract %18, %20 : tensor<1x10xf32>
  %22 = "mhlo.exponential"(%21) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %23 = "mhlo.reduce"(%22, %6) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %26 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%26) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %24 = "mhlo.broadcast_in_dim"(%23) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %25 = mhlo.divide %22, %24 : tensor<1x10xf32>
  return %25 : tensor<1x10xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After CSE ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After SymbolDCE ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After HLOToHLOPreprocessing ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After RemoveShapeConstraints ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After TosaToSCF ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After TosaToStandard ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After TosaToLinalgOnTensors ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After Canonicalizer ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After SCFToStandard ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After Canonicalizer ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After Inliner ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::Shape::`anonymous-namespace'::ConvertShapeToShapex ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After Canonicalizer ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After CSE ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After LegalizeInputTypes ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After ExpandVariableDynamicDims ***
module  {
  func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
    %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
    %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
    %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
    %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
    %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
    %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
    %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
    %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
    %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
    %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %6 = mhlo.add %4, %5 : tensor<1x128xf32>
    %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
    %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
    %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %10 = mhlo.add %8, %9 : tensor<1x10xf32>
    %11 = "mhlo.reduce"(%10, %1) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
    %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
    %15 = "mhlo.reduce"(%14, %2) ( {
    ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
      %18 = mhlo.add %arg1, %arg2 : tensor<f32>
      "mhlo.return"(%18) : (tensor<f32>) -> ()
    }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
    %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
    %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
    return %17 : tensor<1x10xf32>
  }
}


// *** IR Dump After mlir::iree_compiler::Shape::`anonymous-namespace'::ExpandFunctionDynamicDimsPass ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After mlir::iree_compiler::Shape::`anonymous-namespace'::TieDynamicShapesPass ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
  %8 = "mhlo.dot"(%7, %cst_0) : (tensor<1x128xf32>, tensor<128x10xf32>) -> tensor<1x10xf32>
  %9 = "mhlo.broadcast_in_dim"(%cst) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<10xf32>) -> tensor<1x10xf32>
  %10 = mhlo.add %8, %9 : tensor<1x10xf32>
  %11 = "mhlo.reduce"(%10, %1) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.maximum %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %12 = "mhlo.broadcast_in_dim"(%11) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %13 = mhlo.subtract %10, %12 : tensor<1x10xf32>
  %14 = "mhlo.exponential"(%13) : (tensor<1x10xf32>) -> tensor<1x10xf32>
  %15 = "mhlo.reduce"(%14, %2) ( {
  ^bb0(%arg1: tensor<f32>, %arg2: tensor<f32>):  // no predecessors
    %18 = mhlo.add %arg1, %arg2 : tensor<f32>
    "mhlo.return"(%18) : (tensor<f32>) -> ()
  }) {dimensions = dense<1> : tensor<1xi64>} : (tensor<1x10xf32>, tensor<f32>) -> tensor<1xf32>
  %16 = "mhlo.broadcast_in_dim"(%15) {broadcast_dimensions = dense<0> : tensor<1xi64>} : (tensor<1xf32>) -> tensor<1x10xf32>
  %17 = mhlo.divide %14, %16 : tensor<1x10xf32>
  return %17 : tensor<1x10xf32>
}

// *** IR Dump After mlir::iree_compiler::Shape::`anonymous-namespace'::MaterializeShapeCalculationsPass ***
func @predict(%arg0: tensor<1x28x28x1xf32>) -> tensor<1x10xf32> attributes {iree.module.export, iree.reflection = {abi = "sip", abiv = 1 : i32, f = "I15!B11!d1d28d28d1R9!B6!d1d10", fv = "1", sip = "I8!S5!k0_0R3!_0"}} {
  %0 = mhlo.constant dense<0.000000e+00> : tensor<1x128xf32>
  %1 = mhlo.constant dense<0xFF800000> : tensor<f32>
  %2 = mhlo.constant dense<0.000000e+00> : tensor<f32>
  %cst = constant opaque<"_", "0xDEADBEEF"> : tensor<10xf32>
  %cst_0 = constant opaque<"_", "0xDEADBEEF"> : tensor<128x10xf32>
  %cst_1 = constant opaque<"_", "0xDEADBEEF"> : tensor<128xf32>
  %cst_2 = constant opaque<"_", "0xDEADBEEF"> : tensor<784x128xf32>
  %3 = "mhlo.reshape"(%arg0) : (tensor<1x28x28x1xf32>) -> tensor<1x784xf32>
  %4 = "mhlo.dot"(%3, %cst_2) : (tensor<1x784xf32>, tensor<784x128xf32>) -> tensor<1x128xf32>
  %5 = "mhlo.broadcast_in_dim"(%cst_1) {broadcast_dimensions = dense<1> : tensor<1xi64>} : (tensor<128xf32>) -> tensor<1x128xf32>
  %6 = mhlo.add %4, %5 : tensor<1x128xf32>
  %7 = mhlo.maximum %6, %0 : tensor<1x128xf32>
